---
kind: method
id: M:Autodesk.Revit.DB.Edge.Tessellate
source: html/fa6a5c7a-b35e-a8df-9c98-838a298d3020.htm
---
# Autodesk.Revit.DB.Edge.Tessellate Method

Returns a polyline approximation to the edge.

## Syntax (C#)
```csharp
public IList<XYZ> Tessellate()
```

## Remarks
Tolerance of approximation is defined internally by Revit to be adequate for
display purposes.